#include <iostream>

using namespace std;
  
   /*
    1.1.0 Напишите функцию, которая принимает <имя> в качестве аргумента и печатает его.
    1.1.0 Напишите функцию, которая принимает <имя>, <фамилия> и <возраст> в качестве входных данных и печатает эту информацию.
    1.1.1 Напишите функцию, которая принимает в качестве аргумента два целых числа. Она должна возвращать true, если они равны, и false в противном случае.

    1.1.2 Напишите функцию, которая принимает в качестве аргумента целое неотрицательное число N. 
          Функция должна выводить целые числа в диапазоне от 0 до N.

    1.1.3 Напишите функцию, которая принимает в качестве аргумента целое неотрицательное число N. 
          Функция вычисляет сумму целых чисел в диапазоне от 0 до N, И ВОЗВРАЩАЕТ ее.
    */
    
    // разместите свой код здесь
    
    
    
    
    
    
    /*
    2.1 Напишите функцию, которая вычисляет и возвращает факториал заданного числа в качестве аргумента. Используйте цикл for или while. Например, если пользователь ввел 3, программа должна вывести 6 (1*2*3).

    *Небольшая помощь для вас:  

        Нагадую що факторіал числа це: 1 * 2 * 3 * 4 * ... * N. 
        Тоді, факториал 4 таков: 4! = 1*2*3*4 = 24.
        Факториал 4 это: 7! = 1*2*3*4*...*7 = 5040.
        Факториал 10 равен: 10! = 1*2*3*4*...*10 = 3628800.
        

    А ось приклад виклику цієї функції:
    int facto_res = facto(4);
    */
    
    // разместите здесь свой код
    
    
    
    
    /*
    
    2.1* Напишите функцию, которая вычисляет отдельную сумму четных или нечетных чисел в последовательности из диапазона от 1 до N. 
    Эта функция должна принимать в качестве аргумента количество элементов в последовательности - N, а также 
    также символ char 'e' 'o': 'e' для четных чисел, а 'o' для нечетных.

        Допустим, я хочу вычислить сумму нечетных чисел в диапазоне от 1 до 5. 
        Тогда я должен вызвать эту функцию следующим образом:

            int result = calculateSumEven_Odd(5, 'o');

        Результатом будет сумма всех нечетных чисел в диапазоне от 1 до 5: 1, 2, 3, 4, 5. 
        Таким образом, возвращаемый результат будет равен 1 + 3 + 5 = 9.

    */ 
     
    
    
    // разместите здесь свой код
    
    
    
    
    
    
    /*
    3.  Представьте, что вы работаете над приложением онлайн-чата. У вас есть модель с двумя пользователями, и вы должны оперировать следующей информацией:
        - ник (например: "Nick");
        - номер телефона (например: +380 12 345 67 89)
        - номер счета (например: 543GDR45GF);
        - активность (онлайн/офлайн, булево);

        Вы должны создать простую программную модель, позволяющую этим двум пользователям общаться друг с другом с помощью известной информации. 
        Пользователи должны обладать следующими способностями:
        - addUserToContacts()
        - sendMessage()
        - makeAudioCall()
        - makeVideoCall()
        - makePhoneCall()

    Вам нужно сделать эти функции для каждого из двух пользователей (мы пока не знаем о классах в C++, извините 😄).

    Вы должны выяснить, в каких ситуациях какие данные для функций нужны в качестве входных, а какие в качестве выходных. Также вам нужно выяснить, в каких ситуациях какие данные для функций нужны как входные, а какие как выходные. А также продумайте простую логику для ваших функций, например, пользователь-1 не сможет успешно совершить видеозвонок пользователю-2, если пользователь-2 находится в автономном режиме. 

    Или, скажем, пользователь-1 хочет добавить пользователя-2 в контакты. Предположим, что при добавлении друга нужно ввести правильный номер телефона, и если он совпадает с существующим (пользователя-2), то пользователь-2 будет успешно добавлен в контакты пользователя-1.
    */

void printnamesAndsurnameAndage (string name , string surmame , string age )
{
    cout << "\n";
    cout << name << "\n";
    cout << "\n";

    cout << "\n";
    cout << surmame << "\n";
    cout << "\n";

    cout << "\n";
    cout << age << "\n";
    cout << "\n";
}

void printnames(string name)
{
    cout << "\n";
    cout << name << "\n";
    cout << "\n";
}

int nambercomparison(int a , int b)
{
bool c;

if (a == b)
{
    c = 1;
    cout << boolalpha << c << "\n";
    
}
else
{
    c = 0;

    cout << boolalpha << c << "\n";
}



 return c;
}
int qwerty()
{
    int b = 0;
    int n = 1;
    for (int j = 0; j < n; j++)
{
    int a;
    cout << "create new positive namber: ";

    cin >> a;
    
   
   if (a > 0)
   {
    for (int i = 0; i <= a ; i++)
{
        b = b + i;
        cout << b << "\n";
        
}
    
}
   else
{
    cout << "namber is negative " << "\n";
    n++;
}
}
   
  return b; 
}

int qwerty2()
{
    int b = 0;
    int n = 1;

    for (int j = 0; j < n; j++)
{
    int a;
    cout << "create new positive namber: ";

    cin >> a;
    
   
   if (a > 0)
{
    for (int i = 0; i <= a ; i++)
{

        cout << b << "\n";
        b ++;
}
    
}
   else
{
    cout << "namber is negative " << "\n";
    n++;
}
}
   
  return b; 
}


int  qwerty3()
{
    int a;
    int b = 1;
    int c = 1;
    int n = 1;
   for (int s = 0; s < n; s++)
{
    cout << "create namber: ";
    
    cin >> a;

    if (a > 0)
{
    for (int i = 0; i < a; i++)
{
            
    c = c * b;
    cout << c << "\n";
    b++;

}
        
        
}
    else
{
    cout << "namber is negative " << "\n"; 
     n++;
}
}
  return c;
}

int  qwerty4()
{
    string esa; 

    int a;
    int s;
    int b;

    cout << "create new namber: ";
    cin >> a;

    cout << "enter 'e' if want to see sum even numbers, enter 'o' if want to see sum odd numbers:  ";
    cin >> esa;

    if ( esa == "e")
{
            

    for (int i = 0; i < a; i++)
{
    if(i % 2 == 0)
{
          s = i;
          s % 2;
          b += s;
     cout << b << "\n"; 
}
                
}
            
}
        else
{
    for (int i = 0; i < a; i++)
{
             if(i % 2 == 0)
{
   continue;
                
}
    else
{
    s = i;
    b+= s;
    cout << b << "\n"; 

}
                
}
               
}
        
   return b;     
}



void user1(int a)
{
    const string name = "Альфа";
    const string mobile = "+380 12 345 67 89";
    const string id = "54GDR45GF";
    if (a = 1)
    {
    bool active = 1;
    }
    else
    {
    bool active = 0;
    }

}

void user2(int a)
{
    const string name = "Бета";
    const string mobile = "+380 66 782 20 30";
    const string id = "54GDR46GF";
    if (a = 1)
    {
    bool active = 1;
    }
    else
    {
    bool active = 0;
    }
    
     
}

string masage(int a)
{
string x;
if (a == 1)
{
cout << "Введите сообщения" << "\n";
cin >> x;

}
return x;
}
void audioCall(int a)
{
    if (a == 2)
{
    cout << "Вы позвонили"<< "\n";
}
    
}

void videoCall(int a)
{
if (a == 3)
{
    cout << "Вы позвонили по видеосвязи"<< "\n";
}
}


int main()
{
 string name;

     int a;

     int b;

     int c;

  
    cout << " Подключить пользователя 'Альфа'? Введите цифру 1: ";
    cin >> a;

    user1(a);

    cout << " Подключить пользователя 'Бета'? Введите цифру 1: ";
    cin >> b;

    user2(b);
    if (a == 1 && b == 1)
{
    cout << " Выберите пользователя в которго хотите войти, '1' - Альфа, '2' - Бета: ";
    cin >> c;
    if (c == 1)
{
    cout << " Вы выбрали пользователя 'Альфа'" << "\n";
    cout << " Как вы хотите взаимодействовать с пользоватилем 'Бета'? 1 - сообщение, 2 - звонок, 3 - видеовызов,"<< "\n";
    cin >> a;

    if (a == 2)
{
    audioCall(a);
    cout << " Было успешно доставлено пользователю 'Бетa'" << "\n";
}

    if (a == 3)
{
    videoCall(a);
    cout << " Было успешно доставлено пользователю 'Бетa'" << "\n";
}

    if (a == 1)
{
    cout << masage(a) << " Было успешно доставлено пользователю 'Бетa'" << "\n";
}
}
else if (c == 2)
{
    cout << " Вы выбрали пользователя 'Бета'" << "\n";
    cout << " Как вы хотите взаимодействовать с пользоватилем 'Альфа'? 1 - сообщение, 2 - звонок, 3 - видеовызов,"<< "\n";
    cin >> a;
        
    if (a == 2)
{
    audioCall(a);
    cout << " Было успешно доставлено пользователю 'Альфа'" << "\n";
}

    if (a == 3)
{
    videoCall(a);
    cout << " Было успешно доставлено пользователю 'Альфа'" << "\n";
}

    if (a == 1)
{
    cout << masage(a) << " Было успешно доставлено пользователю 'Альфа'" << "\n";
}
}
    
}
else if (a == 0 && b == 1)
{
    cout << " Вы выбрали пользователя 'Бета'" << "\n";
    cout << " Как вы хотите взаимодействовать с пользоватилем 'Альфа'? 1 - сообщение, 2 - звонок, 3 - видеовызов,"<< "\n";
    cin >> a;
        
    if (a == 2)
{
    audioCall(a);
    cout << " Не было доставлено пользователю 'Альфа'" << "\n";
}

    if (a == 3)
{
    videoCall(a);
    cout << " Не было доставлено пользователю 'Альфа'" << "\n";
}

    if (a == 1)
{
    cout << masage(a) << " Не было доставлено пользователю 'Альфа'" << "\n";
}
}
else if (a == 1 && b == 0)
{
    cout << " Вы выбрали пользователя 'Альфа'" << "\n";
    cout << " Как вы хотите взаимодействовать с пользоватилем 'Бета'? 1 - сообщение, 2 - звонок, 3 - видеовызов,"<< "\n";
    cin >> a;

    if (a == 2)
{
    audioCall(a);
    cout << " Не было доставлено пользователю 'Бетa'" << "\n";
}

    if (a == 3)
{
    videoCall(a);
    cout << " Не было доставлено пользователю 'Бетa'" << "\n";
}

    if (a == 1)
{
    cout << masage(a) << " Не было доставлено пользователю 'Бетa'" << "\n";
}

        

}
    

    return 0;
}