#include <iostream>

using namespace std;

int main(int argc, char const*argv[])
{
     // 1. Циклы (for/while/do while)
    // 1.1.0 Напишите программу, которая печатает ваше имя 8 раз.
   
    
  
{
    for (int i=0; i<8;i++)
    cout<<"Ivanov Ivan\n";
}
// 1.1.2 Напишите программу, которая печатает целые числа в диапазоне от 0 до 100.
#include <iostream>

using namespace std;


{
    for (int i=0;i<=100;i++)
    if (i%1==0)
     cout<<i<<"\n";
   
    return 0;
}
 // 1.1.3 Напишите программу, которая печатает целые числа в диапазоне от -10 до 10.




{
    for (int i=-10;i<=10;i++)
    if (i%1==0)
     cout<<i<<"\n";
   
    return 0;
}
  // 1.1.4 Напишите программу, которая печатает целые числа в диапазоне от -100 до 100.
//



  {
    for (int i=-100;i<=100;i++)
    if (i%1==0)
     cout<<i<<"\n";
   
    return 0;
  }

  // 2.1 Напишите программу, которая принимает от пользователя целое положительное число N. 
    // Убедитесь, что пользователь вводит именно положительное число. 
    // После этого - суммируйте ряд чисел от 0 до введенного числа N (0 + 1 + 2 + ... + N). 
    // Например, если пользователь ввел 3 (N = 3), программа должна вывести 6, что означает 1+2+3. 
    // Вы должны использовать цикл for.
    
    // вставьте свой код сюда 
  
#include <iostream>


 int c;
    int q = 1;
    int p = 0;
    int l;
    for (int c; c = 1;)
    {

    cout << "Введите положительное число: ";

    cin >> c;

    if (c > 0)
    {
        int d = c;
        for ( int c = 0; c <= d; c++)
        {
            
            p = p + c;
            cout << p << "\n";
            
        }
        break;
    }
    else
    {
    
        cout << "Не правильно!" << "\n";
        c = 0;
        continue;
    }
    }
    
    // 2.2 Перепишите предыдущую программу, используя цикл while! 
    
    // вставьте свой код сюда 
  
    
    
    
    // 3*. Таймер - это программное или аппаратное устройство в вашем компьютере, смартфоне, ноутбуке, которое отслеживает время, прошедшее между двумя событиями. Этими событиями могут быть щелчок мыши, открытие нового окна браузера, запуск Minecraft и CS:GO и так далее. Таймер отсчитывает время в "тиках". Количество тиков может быть довольно большим числом, чтобы представить 1 секунду.
    // Допустим, 1 секунда = 10 000 тиков. Смоделируйте, что у вас есть промежуток времени в 20 секунд, где:
    // - каждые 10 секунд происходит процесс автосохранения "My-Homework-N4.docx";
    // - каждые 5 секунд обновляется страница браузера;
    // - каждые 1 секунду происходит опрос состояния Wi-Fi соединения;
    // - каждые 1000 тиков опрашивает состояние подключенного зарядного устройства;
    // - каждые 100 тиков опрашивает состояние левой кнопки мыши.
    // Через заданные промежутки времени нужно просто распечатать название процесса, например: "Страница браузера обновилась!", и так далее.

    
    // вставьте сюда свой код 
   int q;
    int w = 20000;
    int e = 1;
    int r = 10;
    int t = 100;
    int y = 500;
    int u = 100;
   
    string x = "Хеллоу";
    for (int q = 0; q <= w; q++)
    {
        cout << x << "\n";

        
 if (q == e)
        {
            e += 1;

            cout << "Состояния левой кнопки мишки: успешно обновлено!" << "\n";
if (q == r)
        {
             r += 10;

            cout << "Состояния зарядного устройства: успешно обновлено!" << "\n";

 if (q == t)
        {
            
            t += 100;

            cout << "Состояния соиденения Wi-Fi: успешно обновлено!" << "\n";

if (q == y)
        {
             y += 500;

            cout << "Состояния страницы браузера: успешно обновлено!" << "\n";

if (q == u)
        {
            u += 100;

            cout << "Состояния автосохранения «My-Homework-N4.docx» : успешно обновлено!" << "\n";

            continue;
        }
        
            continue;
        }
        
            continue;
        }
        
            continue;
        }
        
            continue;
        }
        
        
    }

return 0
}

