#include <iostream>

using namespace std;

int main(int argc, char const*argv[])

   {
     /* 1. Напишите программу, проверяющую, является ли заданное пользователем число положительным или отрицательным. 
          В зависимости от результата - вывести его в консоль. После этого попросите пользователя ввести другое число. 
          Найти наибольшее из двух введенных чисел. В зависимости от результата - сообщить об этом в консоль.
    */
    
    // разместите свой код
    
   int a;

    cout << "Введите первое число== : ";

    cin >> a;
    if (a > 0)
    {
        cout << "число " << a << " позитивноне" << endl;
    }

    else
    {
       cout << "число " << a << " негативное" << endl;
    }
    
    int b;

    cout << "Введите второе число == : ";

    cin >> b;
    if (b > 0)
    {
        cout << "Число " << b << " позитивное" << endl;
    }

    else 
    {
       cout << "Число " << b << " негативное" << endl;
    }
    
    if(a > b)
    {
        cout << "Первое число больше, чем второе" << endl;
    }

    else
    {
        cout << "Второе число больше, чем первое" << endl;
    }
   

   
  
    /* 2. Напишите небольшую программу для сравнения двух строк, значения которых были записаны с клавиатуры пользователя. 
          Также создайте дополнительную логическую переменную (boolean). 
          Если строки одинаковые - выведите следующее сообщение: <ваша_строка_1> равна <ваша_строка_2> и присвойте логической переменной истину, 
          в противном случае - присвойте false и сообщите об этом в консоли.
    */
    
    // разместите свой код
    
    
   {
     cout << "сколько будет 1 + 1? : ";
    cin >> a;

    if (a == 2)
    {
        cout << "правильно!"<<endl;
    }

    else
    {
        cout << "не правильно!"<<endl;
    }

    cout << "сколько будет 1 + 1? : ";

    cin >> b;

    if (b == 2)
    {
        cout << "правильно!"<<endl;
    }

    else
    {
        cout << "не правильно!"<<endl;
    }
    
    bool c;

    if ( a ==  b )
    {
        c = 1;

        cout << "*****************************************" <<endl;

        cout << a << " равняется " << b <<endl;

        cout << boolalpha << c <<endl;
    }
    else 
    {
        c = 0;
        cout << "****************************************" <<endl;

        cout << a << " не равно " << b <<endl;

        cout << boolalpha << c <<endl;
    }
        cout <<endl;
        cout << "*****************************************" <<endl;
        cout <<endl;
    
      
   }
    /* 3. Напишите программу, которая находит наибольшее из трех введенных чисел. 
           В зависимости от результата - сообщите о нем в консоль.
           
           Підказка: используйте if в if:
           
           if (...) 
           {
               if (...) 
               {
                   
               }
           }
           
           или вы можете использовать
            - и &&
            - или || 
    
    */
    
    // поместите сюда свой код
    {
  
  setlocale(0, "");
    
    int one = 0, two = 0, three = 0;
    cout << "Введите первое число: ";
    
    cin >> one;
    
    
    cout << "Введите второе число: ";
    
    cin >> two;
    
    
    cout << "Введите третье число: ";
    
    cin >> three;
        
    if (one > two && one > three)
    
    cout << 'F' << endl;
       
    else
            
    if (two > one && two > three)
    
    cout << 'S' << endl;
    
    else
    
    if (three > one && three > two)
    
    cout << 'T' << endl;
    
    else
    
    if (one == two && two == three)
    
    cout << 'E' << endl;
    
    else
    
    cout << 'N' << endl;
    }
  return 0; 
    
  }
